app/Http/Controllers/EpisodesController.php

    public function update(Request $request, Season $season)
    {
        $watchedEpisodes = $request->episodes;
        $season->episodes->each(function (Episode $episode) use ($watchedEpisodes) {
            $episode->watched = in_array($episode->id, $watchedEpisodes);
        });

        $season->push();
---
select * from "episodes" where "episodes"."season_id" = 37 and "episodes"."season_id" is not null
update "episodes" set "watched" = 1 where "id" = 376