app/Http/Controllers/SeriesController.php

select * from "series" order by "nome" asc
---
    public function index(Request $request)
    {
        $search = request()->input('search');

            if ($search) {
                $series = Series::where('nome', 'like', '%' . $search . '%')->get();
            } else {
                $series = Series::all();

delete from "series" where "id" = 16
---
    public function destroy(Series $series)
    {
        $series->delete();