app/Repositories/EloquentSeriesRepository.php

insert into "series" ("nome", "cover", "updated_at", "created_at") values ('The Witcher', 'series_cover/oUHDqkaOPLCpJKy5MT3UCaAEgq8YfVzMEwfplU2n.jpg', '2023-08-31 02:33:39', '2023-08-31 02:33:39')
insert into "seasons" ("number", "series_id") values (1, 19), (2, 19), (3, 19), (4, 19), (5, 19), (6, 19), (7, 19), (8, 19), (9, 19), (10, 19), (11, 19), (12, 19), (13, 19), (14, 19), (15, 19)
insert into "episodes" ("number", "season_id") values (1, 34), (2, 34), (3, 34), (4, 34), (5, 34), (6, 34), (7, 34), (8, 34), (1, 35), (2, 35), (3, 35), (4, 35), (5, 35), (6, 35), (7, 35), (8, 35), (1, 36), (2, 36), (3, 36), (4, 36), (5, 36), (6, 36), (7, 36), (8, 36)
---
    public function add(SeriesFormRequest $request): Series
    {
        return DB::transaction(function () use ($request) {
            $serie = Series::create([
                'nome' => $request->nome,
                'descricao' => $request->descricao,
                'cover' => $request->coverPath,
            ]);
            $seasons = [];
            for ($i = 1; $i <= $request->seasonsQty; $i++) {
                $seasons[] = [
                    'series_id' => $serie->id,
                    'number' => $i,
                ];
            }
            Season::insert($seasons);

            $episodes = [];
            foreach ($serie->seasons as $season) {
                for ($j = 1; $j <= $request->episodesPerSeason; $j++) {
                    $episodes[] = [
                        'season_id' => $season->id,
                        'number' => $j
                    ];
                }
            }
            Episode::insert($episodes);